WebContent/LxTest.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"xmlns:gateway="http:// www.agree.com.cn /GDBGateway"><soapenv:Header><gateway:HeadType><gateway:versionNo>1</gateway:versionNo><gateway:toEncrypt>0</gateway:toEncrypt><gateway:commCode>510001</gateway:commCode><gateway:commType>0</gateway:commType><gateway:receiverId>CORE</gateway:receiverId><gateway:senderId>PYMT</gateway:senderId><gateway:senderSN>PYMT20140414200009870</gateway:senderSN><gateway:senderDate>20140430</gateway:senderDate><gateway:senderTime>173151</gateway:senderTime><gateway:tradeCode>IBS081</gateway:tradeCode><gateway:gwErrorCode>01</gateway:gwErrorCode><gateway:gwErrorMessage /></gateway:HeadType></soapenv:Header><soapenv:Body><gateway:Core><!-- 新核心主机专用（响应）报文头--><gateway:CoreHeader><gateway:REQ_SEQ_NO>PYMT20140414200009870</gateway:REQ_SEQ_NO><gateway:RET_STATUS>N</gateway:RET_STATUS><gateway:RET_CODE>0000</gateway:RET_CODE><gateway:RET_MSG>交易成功</gateway:RET_MSG><gateway:HOST_DATE>20140430</gateway:HOST_DATE><gateway:HOST_TIME>163527</gateway:HOST_TIME><gateway:AC_DATE>20140414</gateway:AC_DATE><gateway:JRN_NO>000000222335</gateway:JRN_NO><gateway:VCH_NO>000000222335</gateway:VCH_NO><gateway:TR_BANK>101</gateway:TR_BANK><gateway:TR_BRANCH>150001</gateway:TR_BRANCH><gateway:SYNC_ID /><gateway:MAC /></gateway:CoreHeader><gateway:CoreBody><gateway:field name="AC_NO">160000000192</gateway:field><gateway:field name="CI_NO">960000913614</gateway:field><gateway:field name="BIC_CODE">12345678901</gateway:field><gateway:field name="CCY">156</gateway:field><gateway:field name="PRD_CODE">IB02</gateway:field><gateway:field name="AC_TYPE">60</gateway:field></gateway:CoreBody></gateway:Core></soapenv:Body></soapenv:Envelope>